# AsUniqueIdentifier Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolGeometryId..::..AsUniqueIdentifier Method
SymbolGeometryId Class See Also
---
Returns a string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public string AsUniqueIdentifier()
```

Visual Basic
---
```text
Public Function AsUniqueIdentifier As String
```

Visual C++
---
```text
public:
String^ AsUniqueIdentifier()
```

# ### Return Value
A string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element.
# See Also
SymbolGeometryId Class
Autodesk.Revit.DB Namespace